; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	instrument11 - instrument
	infrared0 - mode
	thermograph1 - mode
	image6 - mode
	thermograph2 - mode
	thermograph3 - mode
	infrared5 - mode
	spectrograph4 - mode
	GroundStation3 - direction
	GroundStation2 - direction
	Star1 - direction
	GroundStation4 - direction
	Star0 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 infrared5)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph4)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument2 image6)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 infrared5)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 thermograph2)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 infrared5)
	(supports instrument6 spectrograph4)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument7 thermograph2)
	(supports instrument7 image6)
	(calibration_target instrument7 Star0)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star6)
	(supports instrument8 image6)
	(supports instrument8 thermograph3)
	(calibration_target instrument8 Star1)
	(supports instrument9 infrared0)
	(supports instrument9 image6)
	(calibration_target instrument9 Star1)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation4)
	(supports instrument10 thermograph3)
	(supports instrument10 spectrograph4)
	(supports instrument10 thermograph2)
	(calibration_target instrument10 GroundStation4)
	(supports instrument11 infrared5)
	(supports instrument11 image6)
	(calibration_target instrument11 Star0)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon10)
)
(:goal (and
	(pointing satellite0 Star1)
	(pointing satellite4 Planet9)
	(pointing satellite5 GroundStation3)
	(have_image Planet5 spectrograph4)
	(have_image Star6 infrared0)
	(have_image Planet7 thermograph1)
	(have_image Planet8 image6)
	(have_image Planet8 thermograph3)
	(have_image Planet9 spectrograph4)
	(have_image Phenomenon10 thermograph3)
	(have_image Phenomenon10 spectrograph4)
))

)

; plan
1. (turn_to satellite5 groundstation3 phenomenon10)
   deleted: (pointing satellite5 phenomenon10)
   added: (pointing satellite5 groundstation3)
   goals met: 1 of 11
2. (turn_to satellite4 star1 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 star1)
   goals met: 1 of 11
3. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 1 of 11
4. (calibrate satellite4 instrument8 star1)
   added: (calibrated instrument8)
   goals met: 1 of 11
5. (turn_to satellite4 planet8 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 planet8)
   goals met: 1 of 11
6. (turn_to satellite1 star0 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star0)
   goals met: 1 of 11
7. (turn_to satellite0 groundstation3 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 11
8. (take_image satellite4 planet8 instrument8 thermograph3)
   added: (have_image planet8 thermograph3)
   goals met: 2 of 11
9. (take_image satellite4 planet8 instrument8 image6)
   added: (have_image planet8 image6)
   goals met: 3 of 11
10. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 3 of 11
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 11
12. (calibrate satellite1 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 3 of 11
13. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 3 of 11
14. (turn_to satellite0 phenomenon10 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 11
15. (take_image satellite0 phenomenon10 instrument1 spectrograph4)
   added: (have_image phenomenon10 spectrograph4)
   goals met: 4 of 11
16. (turn_to satellite0 planet5 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet5)
   goals met: 4 of 11
17. (take_image satellite0 planet5 instrument1 spectrograph4)
   added: (have_image planet5 spectrograph4)
   goals met: 5 of 11
18. (turn_to satellite0 planet7 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet7)
   goals met: 5 of 11
19. (take_image satellite0 planet7 instrument1 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 6 of 11
20. (turn_to satellite0 planet9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet9)
   goals met: 6 of 11
21. (take_image satellite0 planet9 instrument1 spectrograph4)
   added: (have_image planet9 spectrograph4)
   goals met: 7 of 11
22. (turn_to satellite0 star1 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star1)
   goals met: 8 of 11
23. (turn_to satellite1 phenomenon10 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon10)
   goals met: 8 of 11
24. (take_image satellite1 phenomenon10 instrument4 thermograph3)
   added: (have_image phenomenon10 thermograph3)
   goals met: 9 of 11
25. (turn_to satellite1 star6 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star6)
   goals met: 9 of 11
26. (take_image satellite1 star6 instrument4 infrared0)
   added: (have_image star6 infrared0)
   goals met: 10 of 11
27. (turn_to satellite4 planet9 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 planet9)
   goals met: 11 of 11
